app/views/api/pokemon/show.json.jbuilder

SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 2]]
---
  json.item_ids do
    @pokemon.items.each do |item|